{"meta":{"title":"Study inn","subtitle":"","description":"","author":"He Hao","url":"https://studyinn.com.cn","root":"/"},"pages":[{"title":"分类","date":"2019-11-21T11:19:19.000Z","updated":"2019-11-21T11:20:58.653Z","comments":true,"path":"categories/index.html","permalink":"https://studyinn.com.cn/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2019-11-21T11:19:19.000Z","updated":"2019-11-21T11:19:55.764Z","comments":true,"path":"tags/index.html","permalink":"https://studyinn.com.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"计算机网络-ch3","slug":"计算机网络-ch3","date":"2019-11-20T02:15:30.000Z","updated":"2019-11-21T13:22:36.581Z","comments":true,"path":"2019/11/20/计算机网络-ch3/","link":"","permalink":"https://studyinn.com.cn/2019/11/20/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C-ch3/","excerpt":"","text":"第三章 数据链路层 数据链路层：在物理层提供服务的基础上向网络层提供服务，其最基本的服务是将源自网络层的数据可靠地传输到相邻节点的目标机网络层。其主要作用是加强物理层传输原始比特流的功能，将物理层提供的可能出错的连接改造成逻辑上无差错的数据链路，使对网络层表现为无差错的链路。 链路：从一个结点到相邻节点的一段物理线路（有线或无线），而中间码元其他的交换结点。 数据链路：当需要在一条线路上传送数据时，除了必须有一条物理线路外，还必须有一些必要的通信协议控制这些数据。把这些协议的硬件和软件加到链路上就构成了数据链路。 数据链路层的功能 为网络层提供服务：包括无确认无连接服务、有确认无连接服务、有确认面向连接服务。 无确认无连接服务：源机器发送数据帧时无需先建立链路连接，目的机器收到数据帧时不需要发回确认。丢失的帧数据链路层不负责重发而交给上层处理。适用于实时通信和误码率较低的通信信道，如以太网。 有确认无连接服务：源机器发送数据帧时无需先建立链路连接，但目的机器收到数据帧时要发回确认，源机器在规定时间内未收到确定信号就重传丢失的帧，以提高传输的可靠性。适用于误码率较高的通信信道，如无线通信。 有确认面向连接服务：源机器发送数据帧时要先建立链路连接，且目的机器收到数据帧时要发回确认，源机器收到确认后才能发送下一帧，因此该服务可靠性最高，适用于通信要求较高的场合。帧传输分为建立数据链路、传输帧、释放数据链路三个步骤。 链路管理：即连接的建立、维持、释放。 流量控制：控制发送方的速度。 差错控制：控制帧错、位错。 封装成帧 封装成帧：就是在一段数据的前后分别添加首部和尾部，这样就构成了一个帧。在网络中数据以帧为最小单位进行传输。 帧定界：即确定帧的界限。首部和尾部中包括许多必要的控制信息，其一个重要作用就是用来帧定界。 帧同步：指接收方应能从接收到的二进制比特流中区分出帧的起始与终止。 最大传送单元MTU：链路层协议规定的所能传送的帧的数据部分长度上限。 透明传输：不管所传数据是何种比特组合，都应当能在链路上传送。 帧定界的方法/保证透明传输的方法： 字符计数法：在帧头部使用一个计数字段来表明帧内字符数。（一错全错） 字节填充法：使用一些特定的字符来定界一帧的开始与结束。为了使信息位中出现的某些特定字符不被误判位帧的首尾部，可以在特殊字符前面添加一个转义字符加以区分。 零比特填充法：使用”01111110“来标志一帧的开始和结束，发送端发现数据部分有五个一则插一个零，接收端见五个一则删一个零。（常用） 违规编码法：如曼彻斯特编码中用两个不会用到的”高-高“电平和”低-低“电平来标志开始与结束。（常用） 差错检测 差错检测：用以使发送方确定接收方是否正确收到其发送的数据的方法。通常差错可分为位错和帧错。 位错：指帧中某些位出现了差错，通常采用循环冗余检验（CRC）方式发现位错，提高自动重传请求（ARQ）来重传出错的帧。（比特） 帧错：指帧的丢失、重复、失序等错误。在数据链路层引入定时器和编号机制，就能保证每一帧都能有且仅有一次正确的交付给目的节点。（帧） 通常利用编码技术进行差错控制，主要有两类：自动重传请求AQR和前向纠错FEC。 检错编码（针对位错） 检错编码都采用冗余编码技术，其核心思想是在有效数据（信息位）被发送前，先按某种关系附加一定的冗余位，构成一个符合某一规则的编码字后再发送。当要发送的有效数据变化时，相应的冗余位也随之变化，使得码字遵从不变的规则。接收端根据收到的码字是否仍符合原规则来判断是否出错。常见编码有奇偶校验码和循环冗余码。 奇偶校验码 分奇校验码和偶校验码。冗余位加在数据位之前，使得”1“的个数为奇数（或偶数，分别对应奇校验和偶校验），只能检测出50%的比特差错。 循环冗余码CRC 步骤： 加0：待发数据加r个0（r为生成多项式阶数（帧检验序列FCS位数减1））. 模二除：异或操作，加法不进位，减法不错位。 余数为0则接收，否则丢弃。 注：CRC只能做到无比特差错的传输，还并不是可靠传输 纠错编码 通过附加冗余信息使接收方能够推导出发送方实际发送的时什么样的比特串。最常见的纠错编码是海明码，他能发现双比特错误，但只能纠正单比特错误。 帧错 帧错包括帧丢失，帧重复，帧失序 过去OSI的观点：使用帧编号、确认、重传机制。 现在互联网区别对待的方法： 对于通信质量良好的有线传输链路：数据链路层协议不使用确认和重传机制，即不要求数据链路层向上提供可靠传输的服务。如果在数据链路层传输数据时出现了差错并且需要进行改正，那么改正差错的任务就由上层协议（如，运输层的TCP协议）来完成。 对于通信质量较差的无线传输链路：数据链路层协议使用确认和重传机制，数据链路层向上提供可靠传输的服务。 实践证明，这样做可以提高通信效率。 流量控制与可靠传输机制 流量控制：由于双方各自的工作速率和缓存空间的差异，可能出现发送方的发送能力远大于接收方的接收能力，若不适当限制发送方的发送速率（实际就是链路上的信息流量），前面接收的帧将会被后面不断发送来的帧“淹没”，造成帧的丢失而出错。因此流量控制实际上就是限制发送方的数据流量，使其发送速率不超过接收方的接收能力。流量控制的常见方式有两种，即停止-等待协议和滑动窗口协议。 停止-等待协议 原理：发送方每发送一帧，都要等待接收方的应答信号，之后才能发送下一帧；接收方每接收一帧，都要反馈一个应答信号，表示可接收下一帧。如果接收方不反馈应答信号，那么发送方必须一直等待。每次只允许发送一帧，然后就陷入等待接收方确认信息的过程中，因而传输效率很低。 无差错情况： 数据帧丢失或检测到帧出错： ACK丢失： ACK迟到： 滑动窗口协议 原理：在任意时刻，发送方都维持一组连续的允许发送的帧的序号，称为发送窗口；同时接收方也维持一组连续的允许接收帧的序号，称为接收窗口。发送窗口用来对发送方进行流量控制，而发送窗口的大小代表在还未收到对方确认信息的情况下发送方最多还可以发送多少个数据帧。同理，在接收端设置接收窗口是为了控制可以接收哪些数据帧和不可以接收哪些帧。在接收方只有收到的数据帧的序号落入接收窗口内时，才允许将该数据帧收下。若接收到的数据帧落在接收窗口之外，则一律将其丢弃。 后退N帧协议GBN： 选择重传协议SR： 可靠传输机制 数据链路层的可靠传输通常使用确认和超时重传两种机制来完成。 确认ACK是一种无数据的控制帧，这种控制帧使得接收方可以让发送方知道哪些内容被正确接收。有些时候将确认捎带再回复帧中，即捎带确认，可提高传输效率。 超时重传是指再发送方发送某个数据帧后就开启一个计时器，在一定时间内如果某一得到发送方的数据帧和确认帧，那么就重新发送该数据帧，直到发送成功为止。 自动请求重传ARQ通过接收方请求发送方重传出错的数据帧来恢复出错的帧，是通信中用于处理信道所带来差错的方法之一。传统自动重传请求分为三种，即停止等待ARQ、后退N帧ARQ和选择性重传ARQ。后两种协议是滑动窗口技术与请求重发技术的结合，由于窗口尺寸开到足够大时，帧在线路上可以连续地流动，因此又称其为连续ARQ协议。注意，在数据链路层中流量控制机制和可靠传输机制是交织在一起的。 三个协议的窗口大小 协议名称 发送窗口大小 接收窗口大小 停止-等待协议SW 1 1 后退N帧协议GBN &gt;1 =1 选择重传协议SR &gt;1 &gt;1","categories":[{"name":"课程学习","slug":"课程学习","permalink":"https://studyinn.com.cn/categories/%E8%AF%BE%E7%A8%8B%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"计算机网络","slug":"计算机网络","permalink":"https://studyinn.com.cn/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/"}]},{"title":"计算机网络-物理层","slug":"计算机网络-ch2","date":"2019-11-19T14:10:31.000Z","updated":"2019-11-21T12:05:13.998Z","comments":true,"path":"2019/11/19/计算机网络-ch2/","link":"","permalink":"https://studyinn.com.cn/2019/11/19/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C-ch2/","excerpt":"","text":"第二章 物理层 物理层考虑的是怎样才能在连接各种计算机的传输媒体上传输数据，而不是指具体的传输媒体。物理层为数据链路层屏蔽了各种传输媒体的差异，使数据链路层只需要考虑如何完成本层的协议和服务，而不必考虑网络具体的传输媒体是什么。 物理层的主要任务物理层的主要任务是确定与传输媒体接口有关的一些特性： 机械特性：指明接口所用接线器的形状和尺寸、引脚数目和排列、固定和锁定装置。 电气特性：指明在接口电缆的各条线上出现的电压的范围。 功能特性：指明某条线上出现的某一电平的电压表示何种意义。 过程特性：指明对于不同功能的各种可能事件的出现顺序。 信号的传输方式1. 串行传输与并行传输 串行传输：比特一个接一个在一根传输线上进行传输。适合远距离传输，计算机网络采用这种传输。（速度慢、费用低，适合远距离） 并行传输：多个比特同时在多根传输线上传输。不适合远距离传输，成本太高。计算机内部采用这种传输。（速度快、费用高，适合远距离） 2. 同步传输与异步传输 同步传输：比特一个接着一个传输，中间没有间隔，各比特持续时长相等。需要收发双方时钟同步，有两种方法。 外同步：在收发双方之间添加一条单独的时钟信号线。 内同步：发送端将时钟同步信号编码到发送数据中一起传输（例如曼彻斯特编码）。 异步传输 以字节为单位进行传输，字节之间的间隔不固定，但每个字节内的比特持续时长是相等的。 换句话说，字节间异步，比特间仍是同步的。为此，需要给每个字节添加起始位和结束位。 3. 单工、半双工以及全双工传输 单工：单向通信，例如广播。（单向通信） 半双工：双向交替通信（不能同时），例如对讲机。（双向交替通信） 全双工：双向同时通信，例如电话。（双向同时通信） 数据通信中的常用术语 消息（message）：需要计算机处理的文字、图片、音频以及视频等统称为消息。 数据（data）：是运送消息的实体。计算机只能处理二进制数据。 信号：数据的电磁表现 数字信号/连续信号 模拟信号/离散信号 基带信号：来自信源的原始电信号称为基带信号。 数字基带信号：例如在计算机内部，CPU与内存之间所传输的信号。 模拟基带信号：例如，麦克风采集到声音后所产生的音频信号。 调制：基带信号往往包含许多低频成分，甚至有直流成分，而许多信道不能传输这种低频分量或直流分量，因此必须进行调制。 基带调制/编码：仅仅对信号的波形进行变换，使它能与信道特性相适应，变换后的信号任然是基带信号。（数字信道，基带传输） 带通调制：使用载波进行调制，把基带信号的频率范围搬移到较高的频段，并转换为模拟信号，这样就能更好的在模拟信道中传输。经过载波调制后的信号为带通信号。（模拟信道，宽带传输） 编码 两类编码 数字信号转换为另一种数字信号， 在数字信道中传输。 模拟信号转换为数字信号 ，在数字信道中传输。 常用编码 不归零编码（正1负0） 在整个码元时间内不会出现零电平 存在同步问题，需要额外一根传输线来传输时钟信号，使发送方和接收方同步。 对于计算机网络，宁愿利用这根传输线传输数据信号，而不是传输时钟信号。 归零编码（每一码元内都要归为0） 每个码元传输结束后信号都要“归零”，所以接收方只要在信号归零后进行采样即可，不需要单独的时钟信号。 实际上，归零编码相当于把时钟信号用“归零”方式编码在了数据之内，这称为“自同步”信号。 但是，归零编码中大部分的数据带宽，都用来传输“归零”而浪费掉了。 曼彻斯特编码（前高后低、前低后高分别代表0、1（或1、0）） 在码元中间时刻发生电平跳变，既表示时钟，也表示数据 正跳变表示1或0，负跳变表示0或1，可自行定义 传统以太网（10Mb/s）使用该编码 差分曼彻斯特编码(同1异0) 在码元中间时刻发生电平跳变，跳变仅表示时钟。 码元开始处电平是否发生变化表示数据。 比曼彻斯特编码变化少，更适合较高的传输速率。 调制 两类调制 数字信号转换为模拟信号，在模拟信道中传输。 模拟信号转换为另一种模拟信号，在模拟信道中传输。 基本带通调制方法（二元制） 调幅AM：即载波的振幅随基带数字信号而变化。 所调制的信号由两种不同振幅的基本波形构成。 每个基本波形只能表示1比特信息量。 调频FM：即载波的频率随基带数字信号而变化。 所调制的信号由两种不同频率的基本波形构成。 每个基本波形只能表示1比特信息量。 调相PM：即载波的初始相位随基带数字信号而变化。 所调制的信号由两种不同初相位的基本波形构成。 每个基本波形只能表示1比特信息量。 混合调制（多元制） 为了提高信息传输速率，必须采用技术上更为复杂的多元制的振幅相位混合调制方法。例如，将相位与振幅进行混合调制的正交振幅调制QAM。QAM16可以调制出12种相位，每种相位有1或2个种振幅可选。可以调制出16种基本波形，每种波形可以对应表示4个比特。 信道的极限容量 造成信号失真的因素 码元传输速率（越高越失真） 信号传输距离 噪声干扰 传输媒体质量 奈氏准则 在任何信道中，码元传输速率是有上限的，传输速率超过此上限，就会出现严重的码间串扰问题，使接收端对码元的判决（即识别）成为不可能。如果信号的频带越宽，也就是能通过的信号高频分量越多，那么就可以以更高的速率传送码元而不出现码间串扰。 理想低通信道的最高码元传输速率 2W Baud = 2W 波特 = 2W 码元/秒。其中，W为信道带宽，单位是Hz。 理想带通信道的最高码元传输速率 W Baud = W 波特 = W 码元/秒。其中，W为信道带宽，单位是Hz。 注意 实际的信道所能传输的最高码元速率，要明显低于奈氏准则给出的这个上限值。这是因为实际信道还会受到其他很多因素干扰（例如噪声干扰、信号衰减、传输媒体质量等）。 要提高信息传输速率（比特率），就必须设法使每一个码元能携带更多个比特的信息量。这需要采用多元制。 并不是无限制提高每个码元携带的比特数量，就可以无限制地提高信息的传输速率。因为信道的极限信息传输速率还要受限于实际的信号在信道中传输时的信噪比。 香农公式 香农公式指出了信道的极限传输速率。 信噪比：信号的平均功率和噪声的平均功率之比 两种表示方法 S/N 信噪比(dB) = 10 log10(S/N)(dB) 信道的极限传输速率：c = W x log2 (1 + S/N) 注意 在实际信道上能够达到的信息传输速率要比该公式的极限传输速率低不少。这是因为在实际信道中，信号还要收到其他一些损伤，如各种脉冲干扰、信号在传输中的衰减和失真等，这些因素在香农公式中并未考虑。 信道带宽或信道中信噪比越大，信息的极限传输速率越高。 奈氏准则和香农公式的意义 在信道带宽一定的情况下，根据奈氏准则和香农公式，要想提高信息的传输速率就必须采用多元制（更好的调制方法）和努力提高信道中的信噪比。 自从香农公式发表后，各种新的信号处理和调制方法就不断出现，其目的都是为了尽可能地接近香农公式给出的传输速率极限。 物理层下的传输媒体 传输媒体：也叫为传输介质或传输媒介，他就是数据传输系统中在发送器和接收器之间的物理通路，可分为引导型传输媒体和非引导型传输媒体。 引导型传输媒体 同轴电缆 基带同轴电缆（50欧） 用于数字传输，过去用于局域网，现在局域网领域采用双绞线。 宽带同轴电缆（75欧） 用于模拟传输，目前主要用于有线电视。 双绞线 目前的家用以太网，最低应选用超5类（5E）双绞线。 屏蔽双绞线（STP）比非屏蔽双绞线（UTP）具有更好的抗干扰性能，但价格也更贵。 绞合的作用： 抵御部分来自外界的电磁干扰 减少相邻导线的电磁干扰 光纤 多模光纤：存在多条不同角度入射的光线在一条光纤中传输。 光在多模光纤中不断全反射向前传输 由于色散问题，光在多模光纤会产生脉冲展宽的问题 多模光纤只适用于近距离传输（建筑物内） 多模光纤对光源要求不高。可采用便宜的发光二极管作为光源。相应的，可采用光电二极管来检测光脉冲。 单模光纤： 单模光纤的直径仅一个光波的波长。光在其中一直向前传播而不发生全反射。 单模光纤没有脉冲展宽问题 单模光纤适合长距离传输且衰减小，但其制造成本高，对光源要求高。 必须使用昂贵的激光发生器作为光源。相应的，需要使用激光检波器来检测光脉冲。 非引导型传输媒体 无线电波： 低频LF和中频MF频段，使用地面波传输 高频HF和甚高频VHF频段，依靠电离层的反射进行传输 微波： 直线传播，可以穿透电离层 地面100米发生塔，最大视距LOS传输距离为100公里 地球同步卫星 低轨道卫星 红外线 点对点传输 直线传输、中间不能有障碍物，传输距离短 传输速率低（4Mb/s ~ 16Mb/s） 笔记本电脑上已经淘汰 可见光 LiFi比WiFi具有更高的传输速率 目前还在实验研究阶段 常见物理层网络设备 中继器：再生和还原信号（再生数字信号） 集线器/多口中继器：放大再生信号 宽带接入技术 ASDL：即非对称数字用户线，用数字技术对现有的模拟点号用户线进行改造。 光纤同轴混合网（HFC网）：在有线电视网的基础上开发的。 FTTx技术：即光纤到x，如光纤到户FTTH，光线到大楼FTTB等。","categories":[{"name":"课程学习","slug":"课程学习","permalink":"https://studyinn.com.cn/categories/%E8%AF%BE%E7%A8%8B%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"计算机网络","slug":"计算机网络","permalink":"https://studyinn.com.cn/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/"}]},{"title":"计算机网络-概述","slug":"计算机网络-ch1","date":"2019-11-18T14:01:51.000Z","updated":"2019-11-21T12:05:00.681Z","comments":true,"path":"2019/11/18/计算机网络-ch1/","link":"","permalink":"https://studyinn.com.cn/2019/11/18/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C-ch1/","excerpt":"","text":"第一章 概述 host： 即主机。网络把许多计算机连接在一起，而互连网则把许多网络通过路由器连接在一起。与网络相连相连的计算机常称为主机。 ISP： 互联网服务提供商，上网就是通过ISP获得IP地址接入互联网。 IXP： 互联网交换结点，其重要作用就是允许两个网络直接相连并交换分组，而不需要通过第三个网络来转发分组。典型的IXP由一个或多个网络交换机组成。 互联网的组成核心部分： 由所有连接在互联网上的主机组成。这部分是用户直接使用的，用来进行通信（传送数据、音频或视频）和资源共享。 边缘部分： 由大量网络和连接这部分网络的路由器组成。这部分是为边缘部分提供服务的（提供连通性和交换）。 计算机之间的通信方式 C/S方式 ： 即客户-服务器方式，描述的是进程之间服务与被服务的关系。 客户程序 在被用户调用后运行，在通信时主动向远程服务器发起通信（请求服务），因此客户程序必须知道服务器程序的地址。 不需要特殊的硬件和很复杂的操作系统。 服务器程序 是一种专门用来提供某种服务的程序，同时可处理多个远地或本地客户请求。 系统启动后即自动调用并已知不断的运行着，被动的等待或接受来自各地的通信请求。因此，服务器程序不需要知道客户程序的地址。 一般需要由强大的硬件和操作系统的支持。 P2P方式： 即对等连接方式，指两台主机通信时不区分哪一个是请求方哪一个是服务方。只要两台主机都运行了P2P软件，它们就能进行平等的、对等连接通信。这时双方都可以下载对方已存储在硬盘中的共享文件。 三种交换方式及其比较 路由器： router，实现分组交换的关键构件，其任务是转发收到的分组，这就是网络核心部分最重要的功能。 交换（switching） : 就是按照某种方式动态地分配传输线路的资源。 电路交换（circuit switching） 步骤： 建立连接–&gt;通话–&gt;释放连接 从建立连接到释放连接的全部通话时间内，通话的两个用户始终占用端到端的通信资源。 分组交换（packet switching） 步骤： 将报文划分成若干个等长的数据段，然后给各数据段添加首部（包含重要的控制信息）构成分组。 结点交换机（路由器）对分组进行存储转发。 分组从源主机到目的主机，可走不同的路径。 报文交换（message switching） 与分组交换类似但不限制报文的长度对结点交换机的存储空间要求高。 三种交换方式的比较 计算机网络的类别 按网络的作用范围分类 广域网WAN 城域网MAN 局域网LAN 个人区域网PAN，无线个人区域网WPAN 按网络的使用者分类 公用网 专用网 用来把用户接入到互联网的网络 接入网AN（Access Network），接入网本身既不属于互联网的核心部分也不属于互联网的边缘部分。接入网是从某个用户端系统到互联网中的第一个路由器（也称为边缘路由器）之间的网络。 计算机网络的性能指标1. 速率 数据的传送速: 也称数据率（data rate）或比特率（bit rate）,单位是bit/s，有时写作b/s或bps。注意和码元传输速率区分。 注意比特和速率中的单位、大小写字母和换算： 与码元传输速率的区分： 信息传输速率：别名信息速率、比特率，表示单位时间内通过数字通信系统的二进制码元个数，即比特数。（也就是速率） 码元传输速率：别名波形速率、调制速率、符号速率等，表示单位时间内数字通信系统所传输 的码元个数。单位波特（Baud）。 2. 带宽（bandwidth） 通信线路中的带宽： 表示通信线路运行通过的信号频带范围。单位Hz。 计算机网络中的带宽： 表示网络的通信线路所能传送数据的能力，表示单位时间内某信道能够通过的最高数据率。单位bit/s。 3. 吞吐量（throughput） 吞吐量： 表示单位时间内通过某个网络（或信道、接口）的实际数据量，显然其受带宽或网络额定速率的限制。单位bit/s。 4. 时延（delay/latency） 时延： 指数据从网络的一段传送到另一端所需的时间。有时也称延迟或迟延。它由发送时延、传播时延、处理时延、排队时延四个部分构成。 时延四部分 发送时延：transmission delay，是主机或路由器发送数据帧所需要的时间，也叫传输时延。它与信道长度没有任何关系。计算公式为：发送时延 = 数据帧长度(bit) / 发送速率(bit/s)。 传播时延：propagation delay，是电磁波在信道中传播一定距离需要花费的时间。它与信号的发送速率无关，而与信道长度相关。计算公式为：传播时延 = 信道长度(m) / 电磁波在信道上的传播速率(m/s)。 处理时延：主机或路由器在收到分组后需要花费一定的时间进行处理。 排队时延：排队等待处理、排队等待转发。 5. 时延带宽积 时延带宽积： 以比特为单位的链路长度。计算公式为：时延带宽积 = 传播时延 × 带宽 6. 往返时间RTT 往返时间RTT： 指从数据发送端发送数据开始，到发送端收到来自接收端的确认总共经历的时延。 7. 利用率 利用率有信道利用率和网络利用率两种。 信道利用率： 指出某信道有百分之几的时间是被利用的（有数据通过）。 网络利用率： 全网络信道利用率的加权平均值。 根据排队论，当某信道的利用率增大时，该信道引起的时延也会迅速增大。因此，信道利用率并非越高越好。也不能使信道利用率太低，这会使宝贵的通信资源被白白浪费。 8. 丢包率 丢包率： 即分组丢失率，是指在一定的时间范围内，传输过程中丢失的分组数量与总分组数量的比率。具体可分为接口丢包率、结点丢包率、链路丢包率、路径丢包率、网络丢包率等。 分组丢失主要有两种情况： 分组在传输过程中出现误码，被结点丢弃； 分组到达一台队列已满的分组交换机时被丢弃；在通信量较大时就可能造成网络拥塞。 网络协议 网络协议： 是控制两个对等实体进行逻辑通信的规则的集合。 协议的三要素 语法：定义所交换信息的格式。例如，IP数据报的格式。 语义：定义通信双方所要完成的操作。例如，主机HTTP的GET请求给Web服务器，Web服务器收到后执行相应的操作，然后给主机发回HTTP的响应。 同步：定义通信双方的时序关系。例如，TCP的“三报文握手”建立连接。 协议数据单元PDU： 对等层次之间传送的数据包称为该层的协议数据单元PDU。 各层的协议数据单元： 应用层：报文(message) 运输层：TCP报文段(segment)或UDP用户数 据报(datagram) 网络层：分组(packet)或IP数据报 数据链路层：帧(frame) 物理层：比特流(bit stram) 计算网络体系结构 OSI七层体系结构 物理层 数据链路层 网络层 运输层 会话层 表示层 应用层 TCP/IP四层体系结构 网络接口层：类似于OSI模型的物理层和数据链路层，但并没有规定什么具体的内容，目的是为了可以互连各种各样的网络接口。 网际层：核心协议是IP协议，它可以互连各种不同的网络接口，并给运输层的TCP协议和UDP协议提供服务。 运输层：功能是使发送端和目的端上的对等实体进行绘画。 传输控制协议（TCP协议）在享受IP协议提供的服务后，可向应用层的相应协议（例如，HTTP，SMTP等）提供可靠传输的服务。 用户数据报协议（UDP协议）在享受IP协议提供的服务后，可向应用层的相应协议（例如，DNS，RTP等）提供不可靠传输的服务。 应用层：通过应用进程间的交互来完成特定网络应用。如简单电子邮件传输(SMTP)、文件传输协议(FTP)、网络远程访问协议(Telnet)等。 计算机网络五层协议原理体系结构 由于TCP/IP为了互连各种网络接口，其网络接口层并没有什么具体内容，这对于我们学习计算机网络原理来说，不够完整。因此，结合OSI和TCP/IP的优点，提出一种五层协议的原理体系结构，以适用于教学。 物理层 数据链路层 网络层 运输层 应用层 实体、协议、服务和服务访问点 实体： 指任何可发送或接收信息的硬件或软件进程。对等实体： 指通信双方相同层次中的实体。协议是“水平的”，服务是“垂直的”。实体看得见相邻下层所提供的服务，但并不知道实现该服务的具体协议。也就是说，下面的协议对上面的实体是“透明”的。服务访问点： 指在同一系统中相邻两层的实体交换信息的逻辑接口，用于区分不同的服务类型。数据链路层的服务访问点为帧的“类型”字段。网络层的服务访问点为IP数据报首部中的“协议字段”。运输层的服务访问点为“端口号”。服务原语： 指上层使用下层所提供的服务必须通过与下层交换一些命令。服务数据单元SDU： 指同一系统内，层与层之间交换的数据包。多个SDU可以合成为一个PDU；一个SDU也可划分为几个PDU。","categories":[{"name":"课程学习","slug":"课程学习","permalink":"https://studyinn.com.cn/categories/%E8%AF%BE%E7%A8%8B%E5%AD%A6%E4%B9%A0/"}],"tags":[{"name":"计算机网络","slug":"计算机网络","permalink":"https://studyinn.com.cn/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/"}]},{"title":"欢迎来到我的情感博客！","slug":"情感博客","date":"2019-11-17T16:00:00.000Z","updated":"2019-11-21T12:21:07.043Z","comments":true,"path":"2019/11/18/情感博客/","link":"","permalink":"https://studyinn.com.cn/2019/11/18/%E6%83%85%E6%84%9F%E5%8D%9A%E5%AE%A2/","excerpt":"","text":"欢迎来到我的情感博客！","categories":[{"name":"情感","slug":"情感","permalink":"https://studyinn.com.cn/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"情感","slug":"情感","permalink":"https://studyinn.com.cn/tags/%E6%83%85%E6%84%9F/"}]}]}